# TotalDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRunType..::..TotalDepth Property
StairsRunType Class See Also
---
The total depth of the stairs run, only available for monolithic stairs run.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double TotalDepth { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TotalDepth As Double
	Get
```

Visual C++
---
```text
public:
property double TotalDepth {
	double get ();
}
```

# See Also
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace